

var everyDay = new Vue({
    el: "#every_day",
    data: {
        content: "fhdsjhfjsadfhkjdshfkadsfljds"
    },
    computed: {
        getContent: function () {
            return this.content            
        }
    },
    created() {
        axios({
            method: "get",
            url: "/queryEveryDay"

        }).then(res => {
            console.log(res.data.data[0].content)
            this.content = res.data.data[0].content
        }).catch(res => {
            console.log(res)
        })
    },

})
var article_list = new Vue({
    el: "#article_list",
    data: {
        article_list: [
            {
                title: "欢迎灌水交流，别看我长时间不发博，博主可一直都在线~",
                content:"前段时间总是干呕嗳气，吃饭很容易饱，饭后恶心想吐，喝咖啡后更剧烈。首次医院门诊，医生说是可能是胃动力不足消化不良，给开了点儿中成药，没要。问医生是否可以做一下钡餐或胃镜检查一下，于是预约了第二天的胃镜。第一次做胃镜，很顺利。胃镜报告显示胃角C2慢性萎缩性胃炎。几天后活检的病理结果显示慢性萎缩性胃炎，中度萎缩，中度炎症，中度活动，中度肠上皮化生，HP++……好...",
                data:"2018-10-10",
                views:"101",
                tags:"test1",
                id: "1",
                link:""
            },
            {
                title: "欢迎灌水交流，别看我长时间不发博，博主可一直都在线~",
                content:"前段时间总是干呕嗳气，吃饭很容易饱，饭后恶心想吐，喝咖啡后更剧烈。首次医院门诊，医生说是可能是胃动力不足消化不良，给开了点儿中成药，没要。问医生是否可以做一下钡餐或胃镜检查一下，于是预约了第二天的胃镜。第一次做胃镜，很顺利。胃镜报告显示胃角C2慢性萎缩性胃炎。几天后活检的病理结果显示慢性萎缩性胃炎，中度萎缩，中度炎症，中度活动，中度肠上皮化生，HP++……好...",
                data:"2018-10-10",
                views:"101",
                tags:"test1",
                id: "1",
                link:""
            },
            {
                title: "欢迎灌水交流，别看我长时间不发博，博主可一直都在线~",
                content:"前段时间总是干呕嗳气，吃饭很容易饱，饭后恶心想吐，喝咖啡后更剧烈。首次医院门诊，医生说是可能是胃动力不足消化不良，给开了点儿中成药，没要。问医生是否可以做一下钡餐或胃镜检查一下，于是预约了第二天的胃镜。第一次做胃镜，很顺利。胃镜报告显示胃角C2慢性萎缩性胃炎。几天后活检的病理结果显示慢性萎缩性胃炎，中度萎缩，中度炎症，中度活动，中度肠上皮化生，HP++……好...",
                data:"2018-10-10",
                views:"101",
                tags:"test1",
                id: "1",
                link:""
            },
            {
                title: "欢迎灌水交流，别看我长时间不发博，博主可一直都在线~",
                content:"前段时间总是干呕嗳气，吃饭很容易饱，饭后恶心想吐，喝咖啡后更剧烈。首次医院门诊，医生说是可能是胃动力不足消化不良，给开了点儿中成药，没要。问医生是否可以做一下钡餐或胃镜检查一下，于是预约了第二天的胃镜。第一次做胃镜，很顺利。胃镜报告显示胃角C2慢性萎缩性胃炎。几天后活检的病理结果显示慢性萎缩性胃炎，中度萎缩，中度炎症，中度活动，中度肠上皮化生，HP++……好...",
                data:"2018-10-10",
                views:"101",
                tags:"test1",
                id: "1",
                link:""
            }
        ]
    },
    computed: {
        article: function () {
            return this.article_list           
        }
    },

})